OSMICardsTo1Ci/src/Catalogs/ОСМИ_НастройкаСобытий/ОСМИ_НастройкаСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_НастройкаСобытий</name>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсказкаДляПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ОСМИ_Действие</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРассылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OSMICardsTo1Ci/src/CommonModules/ОСМИ_ПодпискиНаСобытия/Module.bsl
Процедура ПроведениеДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСМИ_НастройкаСобытий.Ссылка
	|ИЗ
	|	Справочник.ОСМИ_НастройкаСобытий КАК ОСМИ_НастройкаСобытий
	|ГДЕ
	|	ОСМИ_НастройкаСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	|	И ОСМИ_НастройкаСобытий.Использование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выб = ЗАпрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Выб.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник.Ссылка);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСМИ_НастройкаСобытий.Ссылка
	|ИЗ
	|	Справочник.ОСМИ_НастройкаСобытий КАК ОСМИ_НастройкаСобытий
	|ГДЕ
	|	ОСМИ_НастройкаСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	|	И ОСМИ_НастройкаСобытий.Использование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу( ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выб = ЗАпрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Выб.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник);	
	КонецЦикла;	
	
КонецПроцедуры
